ConnectTest/src/Enums/messageStatuses/messageStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
	<name>messageStatuses</name>
	<enumValues>
		<name>sent</name>
	</enumValues>
	<enumValues>
		<name>notSent</name>
	</enumValues>
	<enumValues>
		<name>delivered</name>
	</enumValues>
	<enumValues>
		<name>notDelivered</name>
	</enumValues>
	<enumValues>
		<name>read</name>
	</enumValues>
	<enumValues>
		<name>undefined</name>
	</enumValues>
</mdclass:Enum>

ConnectTest/src/CommonModules/SmsGold/Module.bsl
//SC-069610
Функция sendSMS(Параметры, Ответ) Экспорт
	
	HTTPСоединение	= Новый HTTPСоединение(Параметры.server, Параметры.port, Параметры.account, Параметры.password,, Параметры.timeout, ?(Параметры.ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL(), Неопределено), Параметры.UseOSAuthentication);	
	
	URL = "http2"+
		"?account="   + Параметры.account +
		"&pass="   + Параметры.password +
		"&number=" + Параметры.phone +
		"&sender=" + Параметры.senderName +
		"&text="   + Параметры.text;
	
	ЗапросHTTP	= Новый HTTPЗапрос(URL);
	ОтветHTTP	= HTTPСоединение.Получить(ЗапросHTTP);
	ТелоЗапроса	= СокрЛП(ОтветHTTP.ПолучитьТелоКакСтроку());
	
	Попытка
		Ответ.Вставить("id", ТелоЗапроса);
		Ответ.Вставить("messageStatus", Перечисления.messageStatuses.sent);		
	Исключение
		Ответ.Вставить("error", ТелоЗапроса);		
	КонецПопытки;
	
	Ответ.Вставить("period", УниверсальноеВремя(ТекущаяДата()));
	
	Возврат Ответ;	
	
КонецФункции

Функция checkSmsStatus(Параметры, Ответ) Экспорт
	
	HTTPСоединение	= Новый HTTPСоединение(Параметры.server, Параметры.port, Параметры.account, Параметры.password,, Параметры.timeout, ?(Параметры.ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL(), Неопределено), Параметры.UseOSAuthentication);	
	
	URL = "http2"+
		"?account="   + Параметры.account +
		"&pass="   + Параметры.password +
		"&smsid="  + Параметры.id;
	
	ЗапросHTTP	= Новый HTTPЗапрос(URL);	
	ОтветHTTP	= HTTPСоединение.Получить(ЗапросHTTP);
	ОтветСтатус	= СокрЛП(ОтветHTTP.ПолучитьТелоКакСтроку());
	
	Статус	= СтатусСообщения(ОтветСтатус);
	
	Если ТипЗнч(Статус) = Тип("ПеречислениеСсылка.messageStatuses") Тогда
		Ответ.Вставить("messageStatus", Статус);
	Иначе
		Ответ.Вставить("messageStatus", Перечисления.messageStatuses.notDelivered);
		Ответ.Вставить("error","Неизвестный статус");
	КонецЕсли;
	
	Ответ.Вставить("period", УниверсальноеВремя(ТекущаяДата()));
	
	Возврат Ответ;
	
КонецФункции

Функция СтатусСообщения(Статус)
	
	Если Статус = "ENROUTE" Или Статус = "ACCEPTD" Тогда
		Возврат Перечисления.messageStatuses.sent;
	ИначеЕсли Статус = "DELETED" Или Статус = "REJECTD" Тогда
		Возврат Перечисления.messageStatuses.notSent;
	ИначеЕсли Статус = "DELIVRD" Тогда
		Возврат Перечисления.messageStatuses.delivered;
	ИначеЕсли Статус = "EXPIRED" Или Статус = "UNDELIV" Или Статус = "UNKNOWN" Тогда
		Возврат Перечисления.messageStatuses.notDelivered;
	Иначе
		Возврат Статус;
	КонецЕсли;

КонецФункции
